In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('cleaned_data_ds_salaries.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,Senior,Full-Time,Data Scientist,85847,ES,Fully Remote,ES,Large
1,2023,Mid-Level,Contract,Machine Learning Engineer,30000,US,Fully Remote,US,Small
2,2023,Mid-Level,Contract,Machine Learning Engineer,25500,US,Fully Remote,US,Small
3,2023,Senior,Full-Time,Data Scientist,175000,CA,Fully Remote,CA,Medium
4,2023,Senior,Full-Time,Data Scientist,120000,CA,Fully Remote,CA,Medium

In [3]:
df.groupby('job_title').sum()['salary_in_usd'].sort_values(ascending=False)

job_title
Data Engineer                171744884
Data Scientist               141320930
Data Analyst                  78017254
Machine Learning Engineer     62170177
AI Engineer                   38431055
Data Architect                16872850
Other                          8019664
Name: salary_in_usd, dtype: int64

In [4]:
df['salary_in_usd'] = pd.to_numeric(df['salary_in_usd'], errors='coerce')

In [5]:
df.groupby('experience_level')[["salary_in_usd"]].mean().sort_values(by="salary_in_usd", ascending=False)

                  salary_in_usd
experience_level
Executive         194930.929825
Senior            153051.071542
Mid-Level         104525.939130
Entry-Level        78546.284375

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary_in_usd       3755 non-null   int64
 5   employee_residence  3755 non-null   object
 6   remote_ratio        3755 non-null   object
 7   company_location    3755 non-null   object
 8   company_size        3755 non-null   object
dtypes: int64(2), object(7)
memory usage: 264.2+ KB

In [7]:
df.groupby(by=["work_year", "job_title"]).sum()[["salary_in_usd"]].sort_values(by="salary_in_usd", ascending=False)

                                     salary_in_usd
work_year job_title
2023      Data Engineer                   86609545
2022      Data Engineer                   78592822
2023      Data Scientist                  66210485
2022      Data Scientist                  64902880
2023      Data Analyst                    40031473
2022      Data Analyst                    33968147
2023      Machine Learning Engineer       32791381
          AI Engineer                     27620044
2022      Machine Learning Engineer       24956280
          AI Engineer                      8974282
2023      Data Architect                   8344782
2022      Data Architect                   7678365
2021      Data Scientist                   7325016
          Data Engineer                    4932542
2023      Other                            4438581
2021      Machine Learning Engineer        3395648
          Data Analyst                     3119922
2020      Data Scientist                   2882549
2022      Other                            2802689
2020      Data Engineer                    1609975
2021      AI Engineer                      1238833
2020      Machine Learning Engineer        1026868
          Data Analyst                      897712
2021      Data Architect                    849703
          Other                             778394
2020      AI Engineer                       597896